## Terraform Plan Results 🏗️

**Environment:** `development`
**Workspace:** `development-platform-eks`
**Directory:** `terraform/env-development/platform-layer/eks-auto-mode`

### Format Check: ✅ Passed
### Init: ✅ Passed
### Validate: ✅ Passed
### Plan: ✅ Success

<details>
<summary>Show Plan Output</summary>

```hcl
To view this run in a browser, visit:
https://app.terraform.io/app/Datafaced/development-platform-eks/runs/run-1BC5sC5zdTU9vhik

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_certificate.eks will be read during apply
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_cloudwatch_log_group.eks_cluster will be created
  + resource "aws_cloudwatch_log_group" "eks_cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/dev-eks-auto/cluster"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-2"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-control-plane-logs"
        }
      + tags_all          = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-control-plane-logs"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
    }

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "ap-southeast-2"
      + tags                 = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-nat-eip"
        }
      + tags_all             = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-nat-eip"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
    }

  # aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = false
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "dev-eks-auto"
      + platform_version              = (known after apply)
      + region                        = "ap-southeast-2"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto"
        }
      + tags_all                      = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
      + version                       = "1.31"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + compute_config {
          + enabled       = true
          + node_pools    = [
              + "general-purpose",
              + "system",
            ]
          + node_role_arn = (known after apply)
        }

      + control_plane_scaling_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "172.20.0.0/16"
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing {
              + enabled = true
            }
        }

      + storage_config {
          + block_storage {
              + enabled = true
            }
        }

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-oidc-provider"
        }
      + tags_all        = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-oidc-provider"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_role.eks_auto_node will be created
  + resource "aws_iam_role" "eks_auto_node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSAutoNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-eks-auto-auto-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-auto-node-role"
        }
      + tags_all              = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-auto-node-role"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-eks-auto-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-cluster-role"
        }
      + tags_all              = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-cluster-role"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.eks_auto_node_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_auto_node_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "dev-eks-auto-auto-node-role"
    }

  # aws_iam_role_policy_attachment.eks_auto_node_ecr_readonly will be created
  + resource "aws_iam_role_policy_attachment" "eks_auto_node_ecr_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "dev-eks-auto-auto-node-role"
    }

  # aws_iam_role_policy_attachment.eks_auto_node_ssm will be created
  + resource "aws_iam_role_policy_attachment" "eks_auto_node_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "dev-eks-auto-auto-node-role"
    }

  # aws_iam_role_policy_attachment.eks_auto_node_worker_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_auto_node_worker_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "dev-eks-auto-auto-node-role"
    }

  # aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "dev-eks-auto-cluster-role"
    }

  # aws_iam_role_policy_attachment.eks_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "dev-eks-auto-cluster-role"
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-southeast-2"
      + tags     = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-igw"
        }
      + tags_all = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-igw"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
      + vpc_id   = (known after apply)
    }

  # aws_kms_alias.eks_secrets[0] will be created
  + resource "aws_kms_alias" "eks_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/dev-eks-auto-secrets"
      + name_prefix    = (known after apply)
      + region         = "ap-southeast-2"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.eks_secrets[0] will be created
  + resource "aws_kms_key" "eks_secrets" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for EKS secrets encryption - dev-eks-auto"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::126350206316:root"
                        }
                      + Resource  = "*"
                      + Sid       = "EnableRootAccountFullAccess"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "kms:CallerAccount" = "126350206316"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowEKSToUseKey"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ap-southeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-secrets-key"
        }
      + tags_all                           = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-secrets-key"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
    }

  # aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "ap-southeast-2"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-nat"
        }
      + tags_all                           = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-nat"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-southeast-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-private-rt"
        }
      + tags_all         = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-private-rt"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-southeast-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-public-rt"
        }
      + tags_all         = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-public-rt"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Cluster"                            = "dev-eks-auto"
          + "Name"                               = "dev-eks-auto-private-ap-southeast-2a"
          + "kubernetes.io/cluster/dev-eks-auto" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + tags_all                                       = {
          + "Cluster"                            = "dev-eks-auto"
          + "Environment"                        = "Development"
          + "Layer"                              = "platform"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "dev-eks-auto-private-ap-southeast-2a"
          + "Owner"                              = "Platform-Team"
          + "Project"                            = "eks-auto-mode"
          + "kubernetes.io/cluster/dev-eks-auto" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Cluster"                            = "dev-eks-auto"
          + "Name"                               = "dev-eks-auto-private-ap-southeast-2b"
          + "kubernetes.io/cluster/dev-eks-auto" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + tags_all                                       = {
          + "Cluster"                            = "dev-eks-auto"
          + "Environment"                        = "Development"
          + "Layer"                              = "platform"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "dev-eks-auto-private-ap-southeast-2b"
          + "Owner"                              = "Platform-Team"
          + "Project"                            = "eks-auto-mode"
          + "kubernetes.io/cluster/dev-eks-auto" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Cluster"                            = "dev-eks-auto"
          + "Name"                               = "dev-eks-auto-public-ap-southeast-2a"
          + "kubernetes.io/cluster/dev-eks-auto" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + tags_all                                       = {
          + "Cluster"                            = "dev-eks-auto"
          + "Environment"                        = "Development"
          + "Layer"                              = "platform"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "dev-eks-auto-public-ap-southeast-2a"
          + "Owner"                              = "Platform-Team"
          + "Project"                            = "eks-auto-mode"
          + "kubernetes.io/cluster/dev-eks-auto" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Cluster"                            = "dev-eks-auto"
          + "Name"                               = "dev-eks-auto-public-ap-southeast-2b"
          + "kubernetes.io/cluster/dev-eks-auto" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + tags_all                                       = {
          + "Cluster"                            = "dev-eks-auto"
          + "Environment"                        = "Development"
          + "Layer"                              = "platform"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "dev-eks-auto-public-ap-southeast-2b"
          + "Owner"                              = "Platform-Team"
          + "Project"                            = "eks-auto-mode"
          + "kubernetes.io/cluster/dev-eks-auto" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ap-southeast-2"
      + tags                                 = {
          + "Cluster" = "dev-eks-auto"
          + "Name"    = "dev-eks-auto-vpc"
        }
      + tags_all                             = {
          + "Cluster"     = "dev-eks-auto"
          + "Environment" = "Development"
          + "Layer"       = "platform"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-eks-auto-vpc"
          + "Owner"       = "Platform-Team"
          + "Project"     = "eks-auto-mode"
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + auto_node_role_arn                 = (known after apply)
  + availability_zones                 = [
      + "ap-southeast-2a",
      + "ap-southeast-2b",
    ]
  + cluster_arn                        = (known after apply)
  + cluster_certificate_authority_data = (sensitive value)
  + cluster_endpoint                   = (known after apply)
  + cluster_id                         = (known after apply)
  + cluster_log_group_name             = "/aws/eks/dev-eks-auto/cluster"
  + cluster_name                       = "dev-eks-auto"
  + cluster_oidc_issuer_url            = (known after apply)
  + cluster_oidc_provider_arn          = (known after apply)
  + cluster_platform_version           = (known after apply)
  + cluster_role_arn                   = (known after apply)
  + cluster_version                    = "1.31"
  + configure_kubectl                  = "aws eks update-kubeconfig --region ap-southeast-2 --name dev-eks-auto"
  + private_subnet_ids                 = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids                  = [
      + (known after apply),
      + (known after apply),
    ]
  + secrets_kms_key_arn                = (known after apply)
  + secrets_kms_key_id                 = (known after apply)
  + vpc_cidr                           = "10.0.0.0/16"
  + vpc_id                             = (known after apply)

Run status: planned and saved (confirmable)
Workspace is unlocked

```

</details>

---
*Workflow: `Terraform: Dev Platform EKS` | Run: [19946110593](https://github.com/dr3dr3/terraform/actions/runs/19946110593)*